app/Controllers/Doctores.php

    public function agregarDoctor(){
        $doctor= new Doctor();
        $hoy = new DateTime();
        $FechaNac = new DateTime($this->request->getVar('FechaNac'));
        $FechaNac = $FechaNac->format('Y/m/d');
        $edad =  date_diff($hoy,new DateTime($FechaNac));
        $nombre = $this->request->getVar('Nombre');
        $apellido =$this->request->getVar('Apellido');
        $cedula = $this->request->getVar('Cedula');
        $correoElectronico = $this->request->getVar('CorreoElectronico');
        $datos=[
            'Nombre' => $nombre,
            'Apellido' => $apellido,
            'Cedula' => $cedula,
            'Especialidad' => $this->request->getVar('Especialidad'),
            'NumCelular' => $this->request->getVar('NumCelular'),
            'NumFijo' => $this->request->getVar('NumFijo'),
            'CorreoElectronico' => $correoElectronico,
            'Genero' =>$_POST['Genero'],
            'FechaNac' => $FechaNac,
            'Edad'=> $edad->format('%y years')
        ];
        $doctor->insert($datos);
---
INSERT INTO `doctor` (`Nombre`, `Apellido`, `Cedula`, `Especialidad`, `CorreoElectronico`, `Genero`, `FechaNac`, `Edad`) VALUES ('Jorge', 'Sanchez', '1726550153', 'Ortodensista', 'jorsao@hotmail.com', 'Masculino', '1962/08/22', '59 years')