app/Models/Evento.php

SELECT *
FROM `evento`
---
    public function getEventos(){
        return $this->findAll();